This notebook uses the plug-in `ipython-sql`

In [1]:
import sqlite3
print('sqlite3: %s' % sqlite3.sqlite_version)
import pandas as pd
print('pandas: %s' % pd.__version__)

sqlite3: 3.33.0
pandas: 1.0.3

In [2]:
def get_df(table_name):
    """This function returns the table name selected and returns it as a pandas dataframe"""
    table_con = sqlite3.connect("chinook.db")
    table_df = pd.read_sql_query(f"SELECT * FROM {table_name}", table_con)
    table_con.close()
    del(table_con)
    return table_df

In [3]:
# Load the sql magic plug-in
%load_ext sql
# Auto connect to our database file
%sql sqlite:///chinook.db

## Select Data

In [4]:
%%sql
SELECT * FROM customers
LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [5]:
get_df("customers").head(5)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

## Limit Data

In [6]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
LIMIT 10

 * sqlite:///chinook.db
Done.

[('For Those About To Rock (We Salute You)', 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ('Balls to the Wall', None, 0.99),
 ('Fast As a Shark', 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 0.99),
 ('Restless and Wild', 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 0.99),
 ('Princess of the Dawn', 'Deaffy & R.A. Smith-Diesel', 0.99),
 ('Put The Finger On You', 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ("Let's Get It Up", 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ('Inject The Venom', 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ('Snowballed', 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ('Evil Walks', 'Angus Young, Malcolm Young, Brian Johnson', 0.99)]

In [7]:
get_df("tracks")[["Name", "Composer", "UnitPrice"]].head(10)

,Name,Composer,UnitPrice
0,For Those About To Rock (We Salute You),"Angus Young, Malcolm Young, Brian Johnson",0.99
1,Balls to the Wall,None,0.99
2,Fast As a Shark,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",0.99
3,Restless and Wild,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",0.99
4,Princess of the Dawn,Deaffy & R.A. Smith-Diesel,0.99
5,Put The Finger On You,"Angus Young, Malcolm Young, Brian Johnson",0.99
6,Let's Get It Up,"Angus Young, Malcolm Young, Brian Johnson",0.99
7,Inject The Venom,"Angus Young, Malcolm Young, Brian Johnson",0.99
8,Snowballed,"Angus Young, Malcolm Young, Brian Johnson",0.99
9,Evil Walks,"Angus Young, Malcolm Young, Brian Johnson",0.99

## Special Data

In [8]:
%%sql
SELECT DISTINCT FirstName
FROM employees

 * sqlite:///chinook.db
Done.

[('Andrew',),
 ('Nancy',),
 ('Jane',),
 ('Margaret',),
 ('Steve',),
 ('Michael',),
 ('Robert',),
 ('Laura',)]

In [9]:
get_df("employees")["FirstName"].unique()

array(['Andrew', 'Nancy', 'Jane', 'Margaret', 'Steve', 'Michael',
       'Robert', 'Laura'], dtype=object)

# Counting Data

In [10]:
%%sql
SELECT COUNT(*) FROM tracks

 * sqlite:///chinook.db
Done.

[(3503,)]

In [11]:
get_df("tracks").shape[0]

3503

In [12]:
%%sql
SELECT COUNT(FirstName) FROM customers

 * sqlite:///chinook.db
Done.

[(59,)]

In [13]:
get_df("customers")["FirstName"].count()

59

In [14]:
%%sql
SELECT COUNT(DISTINCT FirstName) FROM employees

 * sqlite:///chinook.db
Done.

[(8,)]

In [15]:
get_df("employees")["FirstName"].unique().shape[0]

8

## Filter Data

In [16]:
%%sql
SELECT * FROM tracks
WHERE UnitPrice > 1.0
LIMIT 10

 * sqlite:///chinook.db
Done.

[(2819, 'Battlestar Galactica: The Story So Far', 226, 3, 18, None, 2622250, 490750393, 1.99),
 (2820, 'Occupation / Precipice', 227, 3, 19, None, 5286953, 1054423946, 1.99),
 (2821, 'Exodus, Pt. 1', 227, 3, 19, None, 2621708, 475079441, 1.99),
 (2822, 'Exodus, Pt. 2', 227, 3, 19, None, 2618000, 466820021, 1.99),
 (2823, 'Collaborators', 227, 3, 19, None, 2626626, 483484911, 1.99),
 (2824, 'Torn', 227, 3, 19, None, 2631291, 495262585, 1.99),
 (2825, 'A Measure of Salvation', 227, 3, 18, None, 2563938, 489715554, 1.99),
 (2826, 'Hero', 227, 3, 18, None, 2713755, 506896959, 1.99),
 (2827, 'Unfinished Business', 227, 3, 18, None, 2622038, 528499160, 1.99),
 (2828, 'The Passage', 227, 3, 18, None, 2623875, 490375760, 1.99)]

In [17]:
df = get_df("tracks")
df = df[df["UnitPrice"] > 1.0].head(10)
df

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
2818,2819,Battlestar Galactica: The Story So Far,226,3,18,None,2622250,490750393,1.99
2819,2820,Occupation / Precipice,227,3,19,None,5286953,1054423946,1.99
2820,2821,"Exodus, Pt. 1",227,3,19,None,2621708,475079441,1.99
2821,2822,"Exodus, Pt. 2",227,3,19,None,2618000,466820021,1.99
2822,2823,Collaborators,227,3,19,None,2626626,483484911,1.99
2823,2824,Torn,227,3,19,None,2631291,495262585,1.99
2824,2825,A Measure of Salvation,227,3,18,None,2563938,489715554,1.99
2825,2826,Hero,227,3,18,None,2713755,506896959,1.99
2826,2827,Unfinished Business,227,3,18,None,2622038,528499160,1.99
2827,2828,The Passage,227,3,18,None,2623875,490375760,1.99

In [18]:
%%sql
SELECT COUNT(*) FROM tracks
WHERE UnitPrice > 1.0 AND UnitPrice < 10

 * sqlite:///chinook.db
Done.

[(213,)]

In [19]:
df = get_df("tracks")
df = df[(df["UnitPrice"] > 1.0) & (df["UnitPrice"] < 10)]
df.shape[0]

213

In [20]:
%%sql
SELECT BillingAddress, BillingCity, Total
FROM invoices
WHERE BillingCity = 'Paris' OR BillingCity = 'Berlin'
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Barbarossastraße 19', 'Berlin', 1.98),
 ('8, Rue Hanovre', 'Paris', 1.98),
 ('8, Rue Hanovre', 'Paris', 13.86),
 ('Tauentzienstraße 8', 'Berlin', 1.98),
 ('Barbarossastraße 19', 'Berlin', 3.96)]

In [21]:
df = get_df("invoices")
df = df[(df["BillingCity"] == "Paris") | (df["BillingCity"] == "Berlin")]
df = df[["BillingAddress", "BillingCity", "Total"]].head(5)
df

         BillingAddress BillingCity  Total
6   Barbarossastraße 19      Berlin   1.98
7        8, Rue Hanovre       Paris   1.98
18       8, Rue Hanovre       Paris  13.86
28   Tauentzienstraße 8      Berlin   1.98
29  Barbarossastraße 19      Berlin   3.96

In [22]:
%%sql
SELECT BillingAddress, BillingCity, Total
FROM invoices
WHERE BillingCity != 'Paris' AND BillingCity <> 'Berlin'
--# the != operator is the same as the <> operator
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Theodor-Heuss-Straße 34', 'Stuttgart', 1.98),
 ('Ullevålsveien 14', 'Oslo', 3.96),
 ('Grétrystraat 63', 'Brussels', 5.94),
 ('8210 111 ST NW', 'Edmonton', 8.91),
 ('69 Salem Street', 'Boston', 13.86)]

In [23]:
df = get_df("invoices")
df = df[(df["BillingCity"] != "Paris") | (df["BillingCity"] != "Berlin")]
df = df[["BillingAddress", "BillingCity", "Total"]].head(5)
df

            BillingAddress BillingCity  Total
0  Theodor-Heuss-Straße 34   Stuttgart   1.98
1         Ullevålsveien 14        Oslo   3.96
2          Grétrystraat 63    Brussels   5.94
3           8210 111 ST NW    Edmonton   8.91
4          69 Salem Street      Boston  13.86

## Data From a List

In [24]:
%%sql
SELECT *
FROM invoices
WHERE BillingCity IN ('Berlin', 'Paris', 'New York', 'Boston', 'London')
LIMIT 5

 * sqlite:///chinook.db
Done.

[(5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (11, 52, '2009-02-06 00:00:00', '202 Hoxton Street', 'London', None, 'United Kingdom', 'N1 5LH', 8.91),
 (19, 40, '2009-03-14 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 13.86)]

In [25]:
df = get_df("invoices")
df = df[df['BillingCity'].isin(['Berlin', 'Paris', 'New York', 'Boston', 'London'])]
df = df.head(5)
df

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86
6,7,38,2009-02-01 00:00:00,Barbarossastraße 19,Berlin,None,Germany,10779,1.98
7,8,40,2009-02-01 00:00:00,"8, Rue Hanovre",Paris,None,France,75002,1.98
10,11,52,2009-02-06 00:00:00,202 Hoxton Street,London,None,United Kingdom,N1 5LH,8.91
18,19,40,2009-03-14 00:00:00,"8, Rue Hanovre",Paris,None,France,75002,13.86

In [26]:
%%sql
SELECT *
FROM invoices
WHERE BillingCity NOT IN ('Berlin', 'Paris', 'New York', 'Boston', 'London')
LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99)]

In [27]:
df = get_df("invoices")
df = df[~df['BillingCity'].isin(['Berlin', 'Paris', 'New York', 'Boston', 'London'])]
df = df.head(5)
df

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
5,6,37,2009-01-19 00:00:00,Berger Straße 10,Frankfurt,None,Germany,60316,0.99

## Between Data

In [28]:
%%sql
SELECT BillingCity, Total
FROM invoices
WHERE Total BETWEEN 5 AND 15
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Brussels', 5.94),
 ('Edmonton', 8.91),
 ('Boston', 13.86),
 ('Dublin', 5.94),
 ('London', 8.91)]

In [29]:
df = get_df("invoices")
df = df[df["Total"].between(5, 15)]
df = df[["BillingCity", "Total"]].head(5)
df

   BillingCity  Total
2     Brussels   5.94
3     Edmonton   8.91
4       Boston  13.86
9       Dublin   5.94
10      London   8.91

## Null Data

In [30]:
%%sql
SELECT COUNT(*) FROM
invoices
WHERE BillingState IS NULL

 * sqlite:///chinook.db
Done.

[(202,)]

In [31]:
get_df("invoices")['BillingState'].isnull().sum()

202

In [32]:
%%sql
SELECT InvoiceDate, BillingCountry
FROM invoices
WHERE Total IS NOT NULL
LIMIT 10

 * sqlite:///chinook.db
Done.

[('2009-01-01 00:00:00', 'Germany'),
 ('2009-01-02 00:00:00', 'Norway'),
 ('2009-01-03 00:00:00', 'Belgium'),
 ('2009-01-06 00:00:00', 'Canada'),
 ('2009-01-11 00:00:00', 'USA'),
 ('2009-01-19 00:00:00', 'Germany'),
 ('2009-02-01 00:00:00', 'Germany'),
 ('2009-02-01 00:00:00', 'France'),
 ('2009-02-02 00:00:00', 'France'),
 ('2009-02-03 00:00:00', 'Ireland')]

In [33]:
df = get_df("invoices")
df = df[~df["Total"].isnull()]
df = df[["InvoiceDate", "BillingCountry"]].head(10)
df

           InvoiceDate BillingCountry
0  2009-01-01 00:00:00        Germany
1  2009-01-02 00:00:00         Norway
2  2009-01-03 00:00:00        Belgium
3  2009-01-06 00:00:00         Canada
4  2009-01-11 00:00:00            USA
5  2009-01-19 00:00:00        Germany
6  2009-02-01 00:00:00        Germany
7  2009-02-01 00:00:00         France
8  2009-02-02 00:00:00         France
9  2009-02-03 00:00:00        Ireland

## Matching Data

In [34]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
WHERE Name LIKE 'B%'
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Balls to the Wall', None, 0.99),
 ('Breaking The Rules', 'Angus Young, Malcolm Young, Brian Johnson', 0.99),
 ('Bad Boy Boogie', 'AC/DC', 0.99),
 ('Blind Man', 'Steven Tyler, Joe Perry, Taylor Rhodes', 0.99),
 ('Bleed The Freak', 'Jerry Cantrell', 0.99)]

In [35]:
df = get_df("tracks")
df = df[df['Name'].str.startswith('B')]
df = df[["Name", "Composer", "UnitPrice"]].head(5)
df

                  Name                                   Composer  UnitPrice
1    Balls to the Wall                                       None       0.99
11  Breaking The Rules  Angus Young, Malcolm Young, Brian Johnson       0.99
17      Bad Boy Boogie                                      AC/DC       0.99
30           Blind Man     Steven Tyler, Joe Perry, Taylor Rhodes       0.99
53     Bleed The Freak                             Jerry Cantrell       0.99

In [36]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
WHERE Name LIKE '%beautiful%'

 * sqlite:///chinook.db
Done.

[('So Beautiful', 'Mick Hucknall', 0.99),
 ('Beautiful Day', 'Adam Clayton, Bono, Larry Mullen, The Edge', 0.99),
 ('Beautiful Boy', None, 0.99),
 ('On the Beautiful Blue Danube', 'Johann Strauss II', 0.99)]

In [37]:
df = get_df("tracks")
df = df[df['Name'].str.contains('beautiful', case=False)]
df = df[["Name", "Composer", "UnitPrice"]].head(5)
df

,Name,Composer,UnitPrice
2445,So Beautiful,Mick Hucknall,0.99
2937,Beautiful Day,"Adam Clayton, Bono, Larry Mullen, The Edge",0.99
3267,Beautiful Boy,None,0.99
3444,On the Beautiful Blue Danube,Johann Strauss II,0.99

In [38]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
WHERE (Name LIKE 'F%') AND (UnitPrice > 1.0)

 * sqlite:///chinook.db
Done.

[('Fallout', None, 1.99),
 ('Further Instructions', None, 1.99),
 ('Flashes Before Your Eyes', None, 1.99),
 ('Fire + Water', None, 1.99),
 ('Five Years Gone', None, 1.99),
 ('Fire In Space', None, 1.99)]

In [39]:
df = get_df("tracks")

# These two ways are the same, but the first one is smaller to write
df = df[(df['Name'].str.contains('^F', case=False)) & (df['UnitPrice'] > 1.0)]
# df = df[(df['Name'].str.lower().str.startswith('f')) & (df['UnitPrice'] > 1.0)]

df = df[["Name", "Composer", "UnitPrice"]]
df

                          Name Composer  UnitPrice
2848                   Fallout     None       1.99
2862      Further Instructions     None       1.99
2880  Flashes Before Your Eyes     None       1.99
2891              Fire + Water     None       1.99
3166           Five Years Gone     None       1.99
3238             Fire In Space     None       1.99

## Aggregate Data

In [40]:
%%sql
SELECT SUM(Total), MAX(Total), MIN(Total), AVG(Total)
FROM invoices

 * sqlite:///chinook.db
Done.

[(2328.600000000004, 25.86, 0.99, 5.651941747572825)]

In [41]:
get_df("invoices")["Total"].agg(['sum', 'max','min','mean'])

sum     2328.600000
max       25.860000
min        0.990000
mean       5.651942
Name: Total, dtype: float64

In [42]:
%%sql
SELECT AVG(Total), BillingCity
FROM invoices
WHERE BillingCity = 'Paris'

 * sqlite:///chinook.db
Done.

[(5.517142857142857, 'Paris')]

In [43]:
df = get_df("invoices")
df = pd.DataFrame({
    "avgTotal": [df[df['BillingCity'] == "Paris"]['Total'].mean()],
    "BillingCity": ["Paris"],
})
df

   avgTotal BillingCity
0  5.517143       Paris

In [44]:
%%sql
SELECT SUM(Total) / COUNT(Total)
FROM invoices

 * sqlite:///chinook.db
Done.

[(5.651941747572825,)]

In [45]:
df = get_df("invoices")
df = pd.DataFrame({
    "mean": [df["Total"].sum() / df["Total"].count()],
})
df

       mean
0  5.651942

In [46]:
%%sql
SELECT Name, Milliseconds / 1000.0 / 60.0
FROM tracks
LIMIT 10

 * sqlite:///chinook.db
Done.

[('For Those About To Rock (We Salute You)', 5.72865),
 ('Balls to the Wall', 5.709366666666667),
 ('Fast As a Shark', 3.84365),
 ('Restless and Wild', 4.20085),
 ('Princess of the Dawn', 6.256966666666667),
 ('Put The Finger On You', 3.4277),
 ("Let's Get It Up", 3.8987666666666665),
 ('Inject The Venom', 3.5139),
 ('Snowballed', 3.3850333333333333),
 ('Evil Walks', 4.391616666666667)]

In [47]:
df = get_df("tracks")[["Name", "Milliseconds"]]
df["AvgDurr"] = df["Milliseconds"] / 1000.0 / 60.0
df = df[["Name","AvgDurr"]].head(10)
df

                                      Name   AvgDurr
0  For Those About To Rock (We Salute You)  5.728650
1                        Balls to the Wall  5.709367
2                          Fast As a Shark  3.843650
3                        Restless and Wild  4.200850
4                     Princess of the Dawn  6.256967
5                    Put The Finger On You  3.427700
6                          Let's Get It Up  3.898767
7                         Inject The Venom  3.513900
8                               Snowballed  3.385033
9                               Evil Walks  4.391617

In [48]:
%%sql
SELECT 
    SUM(Total) as sum_total,
    MAX(Total) as max_total,
    MIN(Total) as min_total,
    SUM(Total) / COUNT(Total) as mean_total
FROM invoices

 * sqlite:///chinook.db
Done.

[(2328.600000000004, 25.86, 0.99, 5.651941747572825)]

In [49]:
df = get_df("invoices")
df = pd.DataFrame({
    "sum_total": [df["Total"].sum()],
    "max_total": [df["Total"].max()],
    "min_total": [df["Total"].min()],
    "mean_total": [df["Total"].sum() / df["Total"].count()],
})
df

   sum_total  max_total  min_total  mean_total
0     2328.6      25.86       0.99    5.651942

## Order Data

In [50]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
WHERE Composer <> 'None'
ORDER BY Composer
LIMIT 10

 * sqlite:///chinook.db
Done.

[('Iron Man', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 0.99),
 ('Children Of The Grave', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 0.99),
 ('Paranoid', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 0.99),
 ('New Rhumba', 'A. Jamal', 0.99),
 ('Astronomy', 'A.Bouchard/J.Bouchard/S.Pearlman', 0.99),
 ('Hard To Handle', 'A.Isbell/A.Jones/O.Redding', 0.99),
 ('Go Down', 'AC/DC', 0.99),
 ('Dog Eat Dog', 'AC/DC', 0.99),
 ('Let There Be Rock', 'AC/DC', 0.99),
 ('Bad Boy Boogie', 'AC/DC', 0.99)]

In [51]:
df = get_df("tracks")
df = df[~df["Composer"].isnull()]
df = df.sort_values("Composer")
df = df[["Name", "Composer", "UnitPrice"]].head(10)
df

,Name,Composer,UnitPrice
2107,Children Of The Grave,"A. F. Iommi, W. Ward, T. Butler, J. Osbourne",0.99
2106,Iron Man,"A. F. Iommi, W. Ward, T. Butler, J. Osbourne",0.99
2108,Paranoid,"A. F. Iommi, W. Ward, T. Butler, J. Osbourne",0.99
1907,New Rhumba,A. Jamal,0.99
414,Astronomy,A.Bouchard/J.Bouchard/S.Pearlman,0.99
2588,Hard To Handle,A.Isbell/A.Jones/O.Redding,0.99
15,Dog Eat Dog,AC/DC,0.99
14,Go Down,AC/DC,0.99
18,Problem Child,AC/DC,0.99
19,Overdose,AC/DC,0.99

In [52]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
WHERE Composer <> 'None'
ORDER BY UnitPrice, Composer, Name
LIMIT 10

 * sqlite:///chinook.db
Done.

[('Children Of The Grave', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 0.99),
 ('Iron Man', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 0.99),
 ('Paranoid', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 0.99),
 ('New Rhumba', 'A. Jamal', 0.99),
 ('Astronomy', 'A.Bouchard/J.Bouchard/S.Pearlman', 0.99),
 ('Hard To Handle', 'A.Isbell/A.Jones/O.Redding', 0.99),
 ('Bad Boy Boogie', 'AC/DC', 0.99),
 ('Dog Eat Dog', 'AC/DC', 0.99),
 ('Go Down', 'AC/DC', 0.99),
 ("Hell Ain't A Bad Place To Be", 'AC/DC', 0.99)]

In [53]:
df = get_df("tracks")
df = df[~df["Composer"].isnull()]
df = df.sort_values(["UnitPrice", "Composer", "Name"])
df = df[["Name", "Composer", "UnitPrice"]].head(10)
df

,Name,Composer,UnitPrice
2107,Children Of The Grave,"A. F. Iommi, W. Ward, T. Butler, J. Osbourne",0.99
2106,Iron Man,"A. F. Iommi, W. Ward, T. Butler, J. Osbourne",0.99
2108,Paranoid,"A. F. Iommi, W. Ward, T. Butler, J. Osbourne",0.99
1907,New Rhumba,A. Jamal,0.99
414,Astronomy,A.Bouchard/J.Bouchard/S.Pearlman,0.99
2588,Hard To Handle,A.Isbell/A.Jones/O.Redding,0.99
17,Bad Boy Boogie,AC/DC,0.99
15,Dog Eat Dog,AC/DC,0.99
14,Go Down,AC/DC,0.99
20,Hell Ain't A Bad Place To Be,AC/DC,0.99

In [54]:
%%sql
SELECT Name, Composer, UnitPrice
FROM tracks
WHERE Composer != 'None'
ORDER BY UnitPrice DESC, Composer DESC, Name DESC
LIMIT 10

 * sqlite:///chinook.db
Done.

[('Time To Kill', 'roger glover', 0.99),
 ('Talk About Love', 'roger glover', 0.99),
 ('Solitaire', 'roger glover', 0.99),
 ('Ramshackle Man', 'roger glover', 0.99),
 ("One Man's Meat", 'roger glover', 0.99),
 ('Lick It Up', 'roger glover', 0.99),
 ('A Twist In The Tail', 'roger glover', 0.99),
 ('Loves Been Good To Me', 'rod mckuen', 0.99),
 ('For Once In My Life', 'orlando murden/ronald miller', 0.99),
 ('The Lady Is A Tramp', 'lorenz hart/richard rodgers', 0.99)]

In [55]:
df = get_df("tracks")
df = df[~df["Composer"].isnull()]
df = df.sort_values(["UnitPrice", "Composer", "Name"], ascending=False)
df = df[["Name", "Composer", "UnitPrice"]].head(10)
df

                       Name                      Composer  UnitPrice
819            Time To Kill                  roger glover       0.99
818         Talk About Love                  roger glover       0.99
823               Solitaire                  roger glover       0.99
820          Ramshackle Man                  roger glover       0.99
824          One Man's Meat                  roger glover       0.99
816              Lick It Up                  roger glover       0.99
821     A Twist In The Tail                  roger glover       0.99
1054  Loves Been Good To Me                    rod mckuen       0.99
1040    For Once In My Life  orlando murden/ronald miller       0.99
1051    The Lady Is A Tramp   lorenz hart/richard rodgers       0.99

In [56]:
%%sql
SELECT GenreID, COUNT(*) as genre_count
FROM tracks
GROUP BY GenreId
LIMIT 10

 * sqlite:///chinook.db
Done.

[(1, 1297),
 (2, 130),
 (3, 374),
 (4, 332),
 (5, 12),
 (6, 81),
 (7, 579),
 (8, 58),
 (9, 48),
 (10, 43)]

In [57]:
get_df("tracks").groupby('GenreId')['GenreId'].count().head(10)

GenreId
1     1297
2      130
3      374
4      332
5       12
6       81
7      579
8       58
9       48
10      43
Name: GenreId, dtype: int64

## Put it all together

In [58]:
%%sql
SELECT 
    GenreId,
    AlbumId,
    COUNT(*) as genre_count,
    AVG(Milliseconds) / 1000.0 / 60.0 as avg_duration,
    AVG(UnitPrice) as avg_price
FROM tracks
GROUP BY GenreId, AlbumId
LIMIT 10

 * sqlite:///chinook.db
Done.

[(1, 1, 10, 4.0006916666666665, 0.99),
 (1, 2, 1, 5.709366666666667, 0.99),
 (1, 3, 3, 4.767155555555556, 0.9899999999999999),
 (1, 4, 8, 5.11095625, 0.9900000000000001),
 (1, 5, 15, 4.90189888888889, 0.9900000000000001),
 (1, 6, 13, 4.424262820512821, 0.9900000000000001),
 (1, 7, 12, 4.513006944444444, 0.9900000000000001),
 (1, 10, 14, 4.67584880952381, 0.9900000000000001),
 (1, 30, 14, 5.345142857142857, 0.9900000000000001),
 (1, 31, 9, 4.566535185185185, 0.99)]

In [59]:
df_group = get_df("tracks").groupby(['GenreId', 'AlbumId'])
df = pd.concat(
    [
        df_group['AlbumId'].count(),
        df_group['Milliseconds'].mean() / 1000.0 / 60.0,
        df_group['UnitPrice'].mean(),
    ],
    axis=1,
    join="inner",
)
df = df.head(10)
df

                 AlbumId  Milliseconds  UnitPrice
GenreId AlbumId
1       1             10      4.000692       0.99
        2              1      5.709367       0.99
        3              3      4.767156       0.99
        4              8      5.110956       0.99
        5             15      4.901899       0.99
        6             13      4.424263       0.99
        7             12      4.513007       0.99
        10            14      4.675849       0.99
        30            14      5.345143       0.99
        31             9      4.566535       0.99

In [60]:
%%sql
SELECT GenreId
FROM tracks
GROUP BY GenreId
HAVING COUNT(GenreId) > 100

 * sqlite:///chinook.db
Done.

[(1,), (2,), (3,), (4,), (7,)]

In [61]:
get_df("tracks").groupby('GenreId').filter(lambda group: len(group) > 100)['GenreId'].unique()

array([1, 2, 3, 4, 7], dtype=int64)